Revit 2027 API
BuiltInFailures.SweepFailures.WallSweepInconsistent Property
 The model contains corrupt elements. Delete the corrupt elements to proceed or cancel the action without deleting the elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallSweepInconsistent { get; }
Public Shared ReadOnly Property WallSweepInconsistent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallSweepInconsistent {
	FailureDefinitionId^ get ();
}
static member WallSweepInconsistent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace